
public class WhatIsNestedClass {

	/*
	 * 중첩클래스(Nested Class) :선언된 위치에 따라 2개로 나뉨
	 * - 멤버 안에 (인스턴스 멤버 클래스)
	 * 
	 * - 메서드 안에 (로컬 클래스)
	 * 		생성자 또는 메서드 내부에서 선언된 클래스를 로컬 클래스라고 한다.
	 * 		로컬 클래스는 생성자와 메서드가 실행될 동안에만 객체 생성 가능 
	 * 
	 * 
	 * 
	 * - 익명 클래스란?
	 *  	상속을 통하지 않고 부모의 특정 메서드를 재정의 하는 방법
	 *  	ex) Tire tire = new Tire(){
	 *  				........
	 *  			}
	 *  	이것을 간소화한 것이 람다표현식이다.
	 *  
	 *  
	 * 
	 * - 바깥 멤버 접근
	 * 		중첩 클래스에서 바깥 클래스의 필드와 메서드를 사용할 때 제한이 따른다.
	 * 		인스턴스 멤버 클래스 - 바깥 클래스의 모든 필드와 메서드 사용 가능 
	 * 		정적 멤버 클래스 - 바깥 클래스의 정적 필드와 정적 메서드만 사용 가능 
	 * 
	 * 
	 * 
	 * */
}
